[
  {
    "title": "Mathématiques, L3 : cours complet avec 400 tests et exercices corrigés",
    "author": "Aviva Szpirglas",
    "publisher": "Pearson education",
    "editionYear": "2009",
    "isbn": "978-2-7440-7351-9",
    "cote": "512-48",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Mathématiques L3 - Algèbre est le dernier volet d'une série couvrant les besoins des étudiants préparant la licence, le Capes ainsi que l'agrégation de mathématiques. Il regroupe un cours complet et détaillé et 400 tests et exercices entièrement corrigés. Particulièrement didactique, il s'applique à faire ressortir les raisons d'être et le sens de toutes les notions introduites, avec de nombreux exemples concrets, des encadrés pédagogiques et des questions tests pour une lecture active. Public visé : étudiants en mathématiques, informatique et physique, candidats au Capes et à l'agrégation."
  },
  {
    "title": "Mathematiques analyse 2 : Calcul intégral, équations différentielles",
    "author": "Pierre Thuillier, Jean-Claude Belloc",
    "publisher": "Dunod",
    "editionYear": "2004",
    "isbn": "978-2-10-008225-4",
    "cote": "515-14",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Mathématiques, Analyse 2 - Calcul intégral, équations différentielles. Ce classique du cours de mathématiques en IUT et BTS est accompagné de nombreux exemples et exercices corrigés."
  },
  {
    "title": "Mathematical Tools for Changing Spatial Scales in the Analysis of Physical Systems",
    "author": "William G. Gray, Anton Leijnse, Randall L. Kolar",
    "publisher": "CRC Press",
    "editionYear": "1993",
    "isbn": "978-0-8493-8934-4",
    "cote": "517-75",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "This book presents a systematic approach to changing spatial scales in differential equations describing physical systems. It introduces mathematical tools for working with vectors, tensors, and differential operators in arbitrary orthogonal coordinate systems without complex Riemann-Christoffel tensors. Features 128 theorems (many previously unpublished) for transforming time-derivative and del operators across scales, with applications to continuum mechanics, porous media physics, heat transfer, and other fields. The work provides practical methods for deriving continuum balance relations for surfaces, multiphase systems, and reduced-dimension problems."
  },
  {
    "title": "Mathématiques 2 : Intégration, transformations intégrales et applications : cours et exercices",
    "author": "Francis Maisonneuve",
    "publisher": "Mines ParisTech",
    "editionYear": "2014",
    "isbn": "978-2-35671-074-1",
    "cote": "515-200",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Cet ouvrage présente la théorie de la mesure et de l'intégrale de Lebesgue et la construction de l'espace de Hilbert L2, ainsi que leur application à l'analyse de Fourier-Laplace et à la convolution des fonctions. Les deux derniers chapitres illustrent ces notions dans le traitement du signal et initient à la théorie des distributions. Le document comporte de nombreux exercices avec corrigés détaillés et s'adresse aux élèves d'écoles d'ingénieurs et étudiants en premier cycle universitaire scientifique. Il sert de support de cours à Mines ParisTech."
  },
  {
    "title": "Mathématiques Analyse : DEUG sciences, 1re année",
    "author": "Guy A. Sedogbo",
    "publisher": "Belin",
    "editionYear": "1998",
    "isbn": "978-2-7011-2288-5",
    "cote": "515-55",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel de mathématiques analyse pour la première année de DEUG sciences."
  },
  {
    "title": "Mathématiques de l'ingénieur",
    "author": "Maurice Chossat, Yannick Privat",
    "publisher": "Dunod, L'Usine nouvelle",
    "editionYear": "2012",
    "isbn": "978-2-10-058240-2",
    "cote": "517-38",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Aide-mémoire contenant toutes les formules et définitions mathématiques utiles aux ingénieurs, avec des tables de fonctions et lois statistiques. Cette troisième édition apporte des compléments sur la théorie de l'approximation, le calcul approché d'intégrales et de dérivées, l'analyse numérique des équations différentielles, et l'optimisation."
  },
  {
    "title": "Mathématiques, L1 : cours complet avec 1000 tests et exercices corrigés",
    "author": "Jean-Pierre Marco, Laurent Lazzarini",
    "publisher": "Pearson education",
    "editionYear": "2010",
    "isbn": "978-2-7440-7258-1",
    "cote": "510-27",
    "numberOfCopies": 6,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel complet de mathématiques pour la première année de licence (L1), comprenant 1000 tests et exercices corrigés. L'ouvrage propose une approche pédagogique avec des bases solides, des exemples concrets, des introductions historiques et de nombreuses illustrations. Il couvre les concepts algébriques et analytiques fondamentaux, avec des compléments pour des applications originales. Destiné aux étudiants en licence de mathématiques suivant le cursus LMD."
  },
  {
    "title": "Mathématiques, PC. deuxième année et Spéciales B : Tome 3: Compléments d'analyse, Statistique et Probabilités",
    "author": "Léonce Lesieur, Jean Lefebvre",
    "publisher": null,
    "editionYear": null,
    "isbn": 5478,
    "cote": "519-109",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel de mathématiques pour la deuxième année de classes préparatoires PC et Spéciales B, couvrant les compléments d'analyse, la statistique et les probabilités."
  },
  {
    "title": "Mathématiques L3 : Analyse - Cours complet avec 600 tests et exercices corrigés",
    "author": "Boumaza Hakim, Collion Stéphane",
    "publisher": "Pearson",
    "editionYear": "2009",
    "isbn": "978-2-7440-7350-2",
    "cote": "515-237",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel complet d'analyse pour la troisième année de licence (L3), comprenant 600 tests et exercices corrigés. Couvre la topologie, mesure et intégration, opérateurs, fonctions d'une variable complexe, analyse de Fourier, calcul différentiel et équations différentielles. Approche didactique avec exemples concrets, encadrés pédagogiques et éléments historiques. Destiné aux étudiants en mathématiques, physique et informatique, ainsi qu'aux candidats au Capes et à l'agrégation de mathématiques."
  },
  {
    "title": "Algorithmes mathématiques et langage BASIC",
    "author": "Khima, Rabah",
    "publisher": "OPU",
    "editionYear": "1992",
    "isbn": "74874-458",
    "cote": "004-143",
    "numberOfCopies": 11,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur les algorithmes mathématiques et leur implémentation en langage BASIC."
  },
  {
    "title": "Mathématiques : tome 1 Algèbre : classes de 1ère [C, D, E], exercices et problèmes avec solutions",
    "author": "André Combes",
    "publisher": "Vuibert",
    "editionYear": "1979",
    "isbn": "978-2-7117-1307-3",
    "cote": "512-87",
    "numberOfCopies": 9,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel d'algèbre pour les classes de première (séries C, D, E) comprenant des exercices et problèmes avec solutions. Onzième édition de cet ouvrage classique couvrant l'algèbre linéaire, la réduction et les espaces préhilbertiens réels."
  },
  {
    "title": "Algorithmique : cours avec 957 exercices et 158 problèmes",
    "author": null,
    "publisher": "Dunod",
    "editionYear": "2010",
    "isbn": "978-2-10-054526-1",
    "cote": "005-552",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Cours complet d'algorithmique avec 957 exercices et 158 problèmes. Cette 3e édition mise à jour inclut deux nouveaux chapitres sur les arbres de Van Emde Boas et les algorithmes multithreads. L'ouvrage couvre un large éventail d'algorithmes, des classiques (tris, hachage) aux plus récents, avec des implémentations en pseudo-code proche des langages Pascal, C et Fortran. Destiné aux étudiants et professionnels en informatique."
  },
  {
    "title": "Exercices et problèmes d'algorithmique numérique : rappels de cours, exercices et problèmes avec corrigés détaillés",
    "author": "Nicolas Flasque, Franck Lepoivre, Nicolas Sicard",
    "publisher": "Dunod",
    "editionYear": "2011",
    "isbn": "978-2-10-055603-8",
    "cote": "005-550",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Recueil d'exercices et problèmes résolus en algorithmique numérique pour licence, écoles d'ingénieurs, IUT, DUT et BTS. Chaque chapitre comprend des rappels de cours, des énoncés d'exercices (environ 50 au total) et leurs solutions détaillées. L'ouvrage traite de la conception d'algorithmes pour le calcul scientifique dans les sciences de l'ingénieur."
  },
  {
    "title": "Turbo C des outils : Par les Mathématiques",
    "author": "Albert Levine",
    "publisher": "Ellipses",
    "editionYear": "1990",
    "isbn": "978-0-0000-0000-0",
    "cote": "005-85",
    "numberOfCopies": 7,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur l'utilisation du langage Turbo C avec des applications mathématiques."
  },
  {
    "title": "Macros et langage VBA : apprendre à programmer sous Excel",
    "author": "Frédéric Le Guen",
    "publisher": "ENI",
    "editionYear": "2015",
    "isbn": "978-2-7460-9335-5",
    "cote": "005-722",
    "numberOfCopies": 8,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ce livre pratique montre comment concevoir des macros et programmes VBA sous Excel pour automatiser des tâches répétitives. Destiné aux utilisateurs quotidiens d'Excel sans expérience en programmation, il couvre l'environnement VBE, les concepts de base du VBA, l'enregistreur de macros, les variables, les structures de contrôle, le débogage, les fonctions, la gestion de fichiers, les boîtes de dialogue personnalisées et la gestion d'erreurs. La 3e édition inclut des exemples pratiques téléchargeables."
  },
  {
    "title": "Langages formels, calculabilité et complexité : licence et master de mathématiques ou d'informatique, option informatique de l'agrégation de mathématiques",
    "author": "Olivier Carton",
    "publisher": "Vuibert",
    "editionYear": "2008",
    "isbn": "978-2-7117-2077-4",
    "cote": "004-155",
    "numberOfCopies": 6,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur les langages formels, la calculabilité et la complexité, destiné aux étudiants en licence et master de mathématiques ou d'informatique, ainsi qu'aux candidats à l'agrégation de mathématiques option informatique."
  },
  {
    "title": "Word 2013",
    "author": "Marina-Nicole Mathias",
    "publisher": "Micro Application",
    "editionYear": "2013",
    "isbn": "978-2-8224-0243-9",
    "cote": "005-595",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide complet pour maîtriser rapidement Word 2013, avec des informations utiles et pratiques."
  }
]