[
  {
    "title": "Mathématiques, L3 : cours complet avec 400 tests et exercices corrigés",
    "author": "Aviva Szpirglas",
    "publisher": "Pearson education",
    "editionYear": "2009",
    "isbn": "978-2-7440-7351-9",
    "cote": "512-48",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Mathématiques L3 - Algèbre est le dernier volet d'une série couvrant les besoins des étudiants préparant la licence, le Capes ainsi que l'agrégation de mathématiques. Il regroupe un cours complet et détaillé et 400 tests et exercices entièrement corrigés. Particulièrement didactique, il s'applique à faire ressortir les raisons d'être et le sens de toutes les notions introduites, avec de nombreux exemples concrets, des encadrés pédagogiques et des questions tests pour une lecture active. Public visé : étudiants en mathématiques, informatique et physique, candidats au Capes et à l'agrégation."
  },
  {
    "title": "Mathematiques analyse 2 : Calcul intégral, équations différentielles",
    "author": "Pierre Thuillier, Jean-Claude Belloc",
    "publisher": "Dunod",
    "editionYear": "2004",
    "isbn": "978-2-10-008225-4",
    "cote": "515-14",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Mathématiques, Analyse 2 - Calcul intégral, équations différentielles. Ce classique du cours de mathématiques en IUT et BTS est accompagné de nombreux exemples et exercices corrigés."
  },
  {
    "title": "Mathematical Tools for Changing Spatial Scales in the Analysis of Physical Systems",
    "author": "William G. Gray, Anton Leijnse, Randall L. Kolar",
    "publisher": "CRC Press",
    "editionYear": "1993",
    "isbn": "978-0-8493-8934-4",
    "cote": "517-75",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "This book presents a systematic approach to changing spatial scales in differential equations describing physical systems. It introduces mathematical tools for working with vectors, tensors, and differential operators in arbitrary orthogonal coordinate systems without complex Riemann-Christoffel tensors. Features 128 theorems (many previously unpublished) for transforming time-derivative and del operators across scales, with applications to continuum mechanics, porous media physics, heat transfer, and other fields. The work provides practical methods for deriving continuum balance relations for surfaces, multiphase systems, and reduced-dimension problems."
  },
  {
    "title": "Mathématiques 2 : Intégration, transformations intégrales et applications : cours et exercices",
    "author": "Francis Maisonneuve",
    "publisher": "Mines ParisTech",
    "editionYear": "2014",
    "isbn": "978-2-35671-074-1",
    "cote": "515-200",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Cet ouvrage présente la théorie de la mesure et de l'intégrale de Lebesgue et la construction de l'espace de Hilbert L2, ainsi que leur application à l'analyse de Fourier-Laplace et à la convolution des fonctions. Les deux derniers chapitres illustrent ces notions dans le traitement du signal et initient à la théorie des distributions. Le document comporte de nombreux exercices avec corrigés détaillés et s'adresse aux élèves d'écoles d'ingénieurs et étudiants en premier cycle universitaire scientifique. Il sert de support de cours à Mines ParisTech."
  },
  {
    "title": "Mathématiques Analyse : DEUG sciences, 1re année",
    "author": "Guy A. Sedogbo",
    "publisher": "Belin",
    "editionYear": "1998",
    "isbn": "978-2-7011-2288-5",
    "cote": "515-55",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel de mathématiques analyse pour la première année de DEUG sciences."
  },
  {
    "title": "Mathématiques de l'ingénieur",
    "author": "Maurice Chossat, Yannick Privat",
    "publisher": "Dunod, L'Usine nouvelle",
    "editionYear": "2012",
    "isbn": "978-2-10-058240-2",
    "cote": "517-38",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Aide-mémoire contenant toutes les formules et définitions mathématiques utiles aux ingénieurs, avec des tables de fonctions et lois statistiques. Cette troisième édition apporte des compléments sur la théorie de l'approximation, le calcul approché d'intégrales et de dérivées, l'analyse numérique des équations différentielles, et l'optimisation."
  },
  {
    "title": "Mathématiques, L1 : cours complet avec 1000 tests et exercices corrigés",
    "author": "Jean-Pierre Marco, Laurent Lazzarini",
    "publisher": "Pearson education",
    "editionYear": "2010",
    "isbn": "978-2-7440-7258-1",
    "cote": "510-27",
    "numberOfCopies": 6,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel complet de mathématiques pour la première année de licence (L1), comprenant 1000 tests et exercices corrigés. L'ouvrage propose une approche pédagogique avec des bases solides, des exemples concrets, des introductions historiques et de nombreuses illustrations. Il couvre les concepts algébriques et analytiques fondamentaux, avec des compléments pour des applications originales. Destiné aux étudiants en licence de mathématiques suivant le cursus LMD."
  },
  {
    "title": "Mathématiques, PC. deuxième année et Spéciales B : Tome 3: Compléments d'analyse, Statistique et Probabilités",
    "author": "Léonce Lesieur, Jean Lefebvre",
    "publisher": null,
    "editionYear": null,
    "isbn": 5478,
    "cote": "519-109",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel de mathématiques pour la deuxième année de classes préparatoires PC et Spéciales B, couvrant les compléments d'analyse, la statistique et les probabilités."
  },
  {
    "title": "Mathématiques L3 : Analyse - Cours complet avec 600 tests et exercices corrigés",
    "author": "Boumaza Hakim, Collion Stéphane",
    "publisher": "Pearson",
    "editionYear": "2009",
    "isbn": "978-2-7440-7350-2",
    "cote": "515-237",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel complet d'analyse pour la troisième année de licence (L3), comprenant 600 tests et exercices corrigés. Couvre la topologie, mesure et intégration, opérateurs, fonctions d'une variable complexe, analyse de Fourier, calcul différentiel et équations différentielles. Approche didactique avec exemples concrets, encadrés pédagogiques et éléments historiques. Destiné aux étudiants en mathématiques, physique et informatique, ainsi qu'aux candidats au Capes et à l'agrégation de mathématiques."
  },
  {
    "title": "Algorithmes mathématiques et langage BASIC",
    "author": "Khima, Rabah",
    "publisher": "OPU",
    "editionYear": "1992",
    "isbn": "74874-458",
    "cote": "004-143",
    "numberOfCopies": 11,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur les algorithmes mathématiques et leur implémentation en langage BASIC."
  },
  {
    "title": "Mathématiques : tome 1 Algèbre : classes de 1ère [C, D, E], exercices et problèmes avec solutions",
    "author": "André Combes",
    "publisher": "Vuibert",
    "editionYear": "1979",
    "isbn": "978-2-7117-1307-3",
    "cote": "512-87",
    "numberOfCopies": 9,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel d'algèbre pour les classes de première (séries C, D, E) comprenant des exercices et problèmes avec solutions. Onzième édition de cet ouvrage classique couvrant l'algèbre linéaire, la réduction et les espaces préhilbertiens réels."
  },
  {
    "title": "Algorithmique : cours avec 957 exercices et 158 problèmes",
    "author": null,
    "publisher": "Dunod",
    "editionYear": "2010",
    "isbn": "978-2-10-054526-1",
    "cote": "005-552",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Cours complet d'algorithmique avec 957 exercices et 158 problèmes. Cette 3e édition mise à jour inclut deux nouveaux chapitres sur les arbres de Van Emde Boas et les algorithmes multithreads. L'ouvrage couvre un large éventail d'algorithmes, des classiques (tris, hachage) aux plus récents, avec des implémentations en pseudo-code proche des langages Pascal, C et Fortran. Destiné aux étudiants et professionnels en informatique."
  },
  {
    "title": "Exercices et problèmes d'algorithmique numérique : rappels de cours, exercices et problèmes avec corrigés détaillés",
    "author": "Nicolas Flasque, Franck Lepoivre, Nicolas Sicard",
    "publisher": "Dunod",
    "editionYear": "2011",
    "isbn": "978-2-10-055603-8",
    "cote": "005-550",
    "numberOfCopies": 12,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Recueil d'exercices et problèmes résolus en algorithmique numérique pour licence, écoles d'ingénieurs, IUT, DUT et BTS. Chaque chapitre comprend des rappels de cours, des énoncés d'exercices (environ 50 au total) et leurs solutions détaillées. L'ouvrage traite de la conception d'algorithmes pour le calcul scientifique dans les sciences de l'ingénieur."
  },
  {
    "title": "Turbo C des outils : Par les Mathématiques",
    "author": "Albert Levine",
    "publisher": "Ellipses",
    "editionYear": "1990",
    "isbn": "978-0-0000-0000-0",
    "cote": "005-85",
    "numberOfCopies": 7,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur l'utilisation du langage Turbo C avec des applications mathématiques."
  },
  {
    "title": "Macros et langage VBA : apprendre à programmer sous Excel",
    "author": "Frédéric Le Guen",
    "publisher": "ENI",
    "editionYear": "2015",
    "isbn": "978-2-7460-9335-5",
    "cote": "005-722",
    "numberOfCopies": 8,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ce livre pratique montre comment concevoir des macros et programmes VBA sous Excel pour automatiser des tâches répétitives. Destiné aux utilisateurs quotidiens d'Excel sans expérience en programmation, il couvre l'environnement VBE, les concepts de base du VBA, l'enregistreur de macros, les variables, les structures de contrôle, le débogage, les fonctions, la gestion de fichiers, les boîtes de dialogue personnalisées et la gestion d'erreurs. La 3e édition inclut des exemples pratiques téléchargeables."
  },
  {
    "title": "Langages formels, calculabilité et complexité : licence et master de mathématiques ou d'informatique, option informatique de l'agrégation de mathématiques",
    "author": "Olivier Carton",
    "publisher": "Vuibert",
    "editionYear": "2008",
    "isbn": "978-2-7117-2077-4",
    "cote": "004-155",
    "numberOfCopies": 6,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur les langages formels, la calculabilité et la complexité, destiné aux étudiants en licence et master de mathématiques ou d'informatique, ainsi qu'aux candidats à l'agrégation de mathématiques option informatique."
  },
  {
    "title": "Word 2013",
    "author": "Marina-Nicole Mathias",
    "publisher": "Micro Application",
    "editionYear": "2013",
    "isbn": "978-2-8224-0243-9",
    "cote": "005-595",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide complet pour maîtriser rapidement Word 2013, avec des informations utiles et pratiques."
  },
  {
    "title": "Bases de données : de la modélisation au SQL : conception des bases de données, modèle relationnel et algèbre relationnelle, langage SQL, programmation SQL",
    "author": "Laurent Audibert",
    "publisher": "Ellipses",
    "editionYear": "2009",
    "isbn": "978-2-7298-5120-0",
    "cote": "004-55",
    "numberOfCopies": 7,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage complet sur les bases de données couvrant la conception, le modèle relationnel, l'algèbre relationnelle, le langage SQL et la programmation SQL. Destiné aux étudiants et professionnels en informatique."
  },
  {
    "title": "Structure des ordinateurs : Autour du professeur",
    "author": "Koudil M.",
    "publisher": "OPU",
    "editionYear": "2000",
    "isbn": "978-9961-0-0429-6",
    "cote": "006-132",
    "numberOfCopies": 28,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur l'architecture et l'organisation des ordinateurs, publié par l'Office des Publications Universitaires (OPU) d'Alger."
  },
  {
    "title": "Programmer en Java",
    "author": "Claude Delannoy",
    "publisher": "Eyrolles",
    "editionYear": "2011",
    "isbn": "978-2-212-13443-8",
    "cote": "005-546",
    "numberOfCopies": 25,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage de référence sur la programmation Java couvrant les versions 5 et 6. Ce best-seller guide les lecteurs à travers la programmation orientée objet, les applications graphiques avec Swing, le développement web avec servlets et JSP, et l'accès aux bases de données avec JDBC. La 6e édition inclut les nouveautés comme la programmation générique, les types énumérés et les annotations."
  },
  {
    "title": "Développez une application Android : programmation en Java sous Eclipse",
    "author": "Serge Ungar",
    "publisher": "Éd. ENI",
    "editionYear": "2013",
    "isbn": "978-2-7460-8111-6",
    "cote": "005-670",
    "numberOfCopies": 18,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide pratique pour développer une application Android complète en Java sous Eclipse. La 2e édition couvre Android 4.0 avec des explications sur les Fragments, Google Analytics, les Flux Asynchrones et la création de composants. Le livre suit un projet concret de location de DVD, abordant les interfaces utilisateur, bases de données, géolocalisation, services, bluetooth et NDK. Comprend des ressources téléchargeables et l'application finale sur le Market Android."
  },
  {
    "title": "Le langage C++",
    "author": "Siddharta Rao, Jesse Liberty, Bradley L. Jones, Olivier Engler",
    "publisher": "Pearson",
    "editionYear": "2012",
    "isbn": "978-2-7440-2546-4",
    "cote": "005-558",
    "numberOfCopies": 18,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage d'initiation au C++ couvrant toutes les bases du langage et la programmation orientée objet, avec de nombreux exemples et exercices. Cette 3e édition mise à jour inclut la norme C++11. Adapté de 'Teach yourself C++ in 21 days' et 'Teach yourself C++ in one hour a day', il permet d'apprendre progressivement ou de se concentrer sur des sujets spécifiques."
  },
  {
    "title": "C#5 : les fondamentaux du langage ; développer avec Visual Studio 2012",
    "author": "Thierry Groussard",
    "publisher": "ENI",
    "editionYear": "2012",
    "isbn": "978-2-7460-7710-2",
    "cote": "005-659",
    "numberOfCopies": 17,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage complet sur C# 5 et .NET 4.5, couvrant la programmation orientée objet, les applications Windows Forms, ADO.NET, LINQ, XML et le déploiement. Destiné aux développeurs débutants et expérimentés, il explique les nouveautés comme la programmation asynchrone et fournit des outils de débogage. Comprend des exemples téléchargeables pour Visual Studio 2012."
  },
  {
    "title": "L'art du développement Android",
    "author": "Grant Allen",
    "publisher": "Pearson",
    "editionYear": "2012",
    "isbn": "978-2-7440-2557-0",
    "cote": "005-578",
    "numberOfCopies": 17,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide complet pour développer des applications Android (version 4.0) pour smartphones et tablettes. Cette 4e édition couvre l'installation du SDK, la création d'interfaces utilisateur, le multi-touch, la géolocalisation, les bases de données, les API multimédias et l'adaptation aux différents appareils. Comprend des exemples pratiques pour maîtriser les activités, intentions et composants Android."
  },
  {
    "title": "Excel 2013",
    "author": null,
    "publisher": "Éd. ENI",
    "editionYear": "2013",
    "isbn": "978-2-7460-7896-3",
    "cote": "005-641",
    "numberOfCopies": 17,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide complet sur Microsoft Excel 2013 couvrant toutes les fonctionnalités du tableur, des bases aux techniques avancées. L'ouvrage traite de la saisie des données, des calculs (simples et complexes), des outils d'analyse (scénarios, valeur cible, Solveur), de la mise en forme des tableaux, des graphiques, des tableaux croisés dynamiques, du travail collaboratif et des macro-commandes. Comprend des ressources complémentaires en ligne."
  },
  {
    "title": "Physics of Semiconductor Devices",
    "author": "S.M. Sze",
    "publisher": "John Wiley & Sons",
    "editionYear": "1981",
    "isbn": "047109837X",
    "cote": "530-262",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Classic reference work on semiconductor device physics covering fundamental principles and operation of various semiconductor devices. The book provides comprehensive treatment of device physics and technology with emphasis on modern devices and integrated circuits."
  },
  {
    "title": "Quantum Mechanics for Applied Physics and Engineering",
    "author": "Albert T. Fromhold Jr.",
    "publisher": "Dover Publications",
    "editionYear": "1981",
    "isbn": "978-0-486-66741-6",
    "cote": "530-290",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Classic Dover publication on quantum mechanics with applications in physics and engineering. The book provides a practical approach to quantum theory with emphasis on its applications in various engineering fields and applied physics."
  },
  {
    "title": "Environmental Physics: Sustainable Energy and Climate Change",
    "author": "Egbert Boeker, Rienk van Grondelle",
    "publisher": null,
    "editionYear": "2011",
    "isbn": "978-0-470-66675-3",
    "cote": "551-37",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "This third edition textbook explores the physics behind sustainable energy and climate change solutions. It emphasizes spectroscopic methods for environmental analysis and energy conversion processes. The book serves as an introduction to physics applied to societal challenges, with companion website materials available. Focuses on quantitative approaches to environmental monitoring and climate change factors."
  },
  {
    "title": "Introduction to the Physics and Techniques of Remote Sensing",
    "author": "Charles Elachi, Jakob Van Zyl",
    "publisher": "Wiley-Interscience",
    "editionYear": "2006",
    "isbn": "978-0-471-47569-9",
    "cote": "530-153",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Comprehensive textbook on remote sensing principles and applications, covering electromagnetic wave interactions, data collection techniques across the spectrum (visible, infrared, microwave), and applications in surface and atmospheric studies. This second edition includes updated technologies, numerous illustrations, color plates, and exercises with solutions. Based on a Caltech course, suitable for students in engineering, physics, geology, and planetary sciences."
  },
  {
    "title": "Revising Basic Physics",
    "author": "M. Nelkon",
    "publisher": "Hart-Davis Educational Limited",
    "editionYear": "1970",
    "isbn": "978-0-247-12712-8",
    "cote": "530-251",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Concise review of fundamental physics principles, serving as a refresher for core concepts. This classic text covers essential topics in physics at an introductory level, suitable for students needing to reinforce their foundational knowledge."
  },
  {
    "title": "Semiconductor Devices: Physics and Technology",
    "author": "Simon M. Sze",
    "publisher": "John Wiley and Sons",
    "editionYear": "1985",
    "isbn": "978-0-471-83704-6",
    "cote": "530-242",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Comprehensive introduction to semiconductor physics and fabrication technology, covering both silicon and gallium arsenide devices. The book presents theoretical and practical aspects of device fabrication with emphasis on integrated circuits. Organized in three parts: basic semiconductor properties, device physics/characteristics (including bipolar, unipolar, microwave and photonic devices), and modern processing technologies from crystal growth to lithography."
  },
  {
    "title": "Solid State Physics",
    "author": "Neil W. Ashcroft, N. David Mermin",
    "publisher": "Holt, Rinehart and Winston",
    "editionYear": "1976",
    "isbn": "978-0-03-083993-1",
    "cote": "530-205",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Classic textbook on solid state physics that has become a standard reference in the field. Covers fundamental principles of crystalline solids, including crystal structure, lattice vibrations, electronic properties, and semiconductor physics. Known for its clear explanations and rigorous treatment of core concepts in condensed matter physics."
  },
  {
    "title": "Dynamic Climatology: Basis in Mathematics and Physics",
    "author": "John N. Rayner",
    "publisher": "Blackwell Publishers",
    "editionYear": "2001",
    "isbn": "978-1-57718-015-9",
    "cote": "551-51",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Introductory textbook exploring the mathematical and physical foundations of climatology and global warming. The book examines key concepts through historical development (spanning 400 years), presenting equations and physical models that reproduce weather phenomena. Offers a comprehensive approach to climate components, covering statistics, dynamics and thermodynamics, unlike most specialized texts in the field."
  },
  {
    "title": "Fundamentals of Quantum Physics: Textbook for Students of Science and Engineering",
    "author": "Pedro Pereyra Padilla",
    "publisher": "Springer Verlag",
    "editionYear": "2012",
    "isbn": "978-3-642-29377-1",
    "cote": "530-107",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Comprehensive quantum mechanics textbook covering dynamical operators and expected values, Heisenberg and matrix representations, Dirac notation, angular momentum, hydrogen atom, spin-field and spin-orbit interactions. Designed for science and engineering students, with numerous illustrations including color diagrams."
  },
  {
    "title": "Climate Change and Climate Modeling",
    "author": "J. David Neelin",
    "publisher": "Cambridge University Press",
    "editionYear": "2010",
    "isbn": "978-0-521-60243-3",
    "cote": "551-107",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Physics",
    "description": "Introductory textbook providing a foundation in climate science, covering global warming, natural climate variations, and climate models. Developed from a UCLA course, it explains model strengths/limitations and quantitative uncertainties without requiring atmospheric science background. Includes online resources: color figures, PowerPoint slides, and problem sets. Suitable for students across sciences with basic calculus and physics knowledge."
  },
  {
    "title": "Climate Change: Identification and Projections",
    "author": "Philippe de Larminat",
    "publisher": "Wiley",
    "editionYear": "2014",
    "isbn": "978-1-84821-777-5",
    "cote": "551-80",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Physics",
    "description": "This book presents an alternative approach to climate modeling using black box-type identification techniques with historical climate data. It provides reproducible methods for climate simulation accessible to both climatologists and non-experts, focusing on statistical validation of models rather than traditional physics-based approaches."
  },
  {
    "title": "Frontiers of Climate Modeling",
    "author": "J.T. Kiehl, V. Ramanathan",
    "publisher": "Campus Press",
    "editionYear": "2011",
    "isbn": "978-0-521-29868-1",
    "cote": "551-84",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Physics",
    "description": "This reference work examines advanced climate modeling techniques, focusing on atmospheric physics and dynamics, atmosphere-ocean interactions, and the impacts of greenhouse gases and aerosols. Originally published in 2006, it covers radiative forcing, cloud formation, deep convection dynamics, and coupled ocean-atmosphere models for researchers and graduate students."
  },
  {
    "title": "GIS and Geocomputation for Water Resource Science and Engineering",
    "author": "Barnali Dixon, Venkatesh Uddameri",
    "publisher": "Wiley",
    "editionYear": "2016",
    "isbn": "978-1-118-35413-1",
    "cote": "551-54",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Comprehensive guide integrating GIS with mathematical models for water resources applications. Uses case studies and hands-on learning to demonstrate how GIS combines with physics-based models, statistical approaches, and information-theoretic tools (neural networks, fuzzy set theory) to develop spatial decision support systems for water management."
  },
  {
    "title": "Light",
    "author": "R.W. Ditchburn",
    "publisher": "Interscience Publishers",
    "editionYear": "1961",
    "isbn": "978-0-486-66667-9",
    "cote": "535-33",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Classic study demonstrating the unification of wave theory and quantum theory of light. Covers interference, diffraction, Huygens' Principle, Fermat's Principle, velocity of light, relativistic optics, polarized light, and quantum theory of radiation. Designed for intermediate physics students, with historical introduction and mathematical content organized for progressive learning."
  },
  {
    "title": "Mathematical Tools for Changing Spatial Scales in the Analysis of Physical Systems",
    "author": "William G. Gray, Anton Leijnse, Randall L. Kolar",
    "publisher": "CRC Press",
    "editionYear": "1993",
    "isbn": "978-0-8493-8934-4",
    "cote": "517-75",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Presents systematic methods for scaling differential equations in physical systems. Introduces 128 theorems for transforming operators between scales, with applications in hydraulics, heat transfer, and continuum mechanics. Avoids complex tensor mathematics by using generalized functions for integration in arbitrary coordinate systems."
  },
  {
    "title": "Structure de la matière: cours et exercices corrigés",
    "author": "Ramdane Benazzouz",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-2-340-01783-2",
    "cote": "541-15",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Introductory textbook on matter structure for first-year science students. Bridges physics and chemistry with clear explanations and solved exercises. Incorporates current IUPAC and IUPAP standards, addressing common learning challenges in this interdisciplinary subject."
  },
  {
    "title": "Theory of stochastic differential equations with jumps and applications: mathematical and analytical techniques with applications to engineering",
    "author": "Rong Situ",
    "publisher": "Springer",
    "editionYear": "2005",
    "isbn": "978-0-387-25083-0",
    "cote": "515-212",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Advanced textbook on stochastic differential equations (SDEs) covering Itô calculus, Girsanov's theorem, and financial applications including option pricing (Black-Scholes formula). Introduces backward SDE techniques for financial markets and reflecting SDEs for population control problems. Valuable for graduate students and researchers in mathematics, physics, engineering, and finance."
  },
  {
    "title": "Electricity 1: vacuum electrostatics 25 problems with solutions",
    "author": "Akbi Mohamed",
    "publisher": "Editions Itinéraires Scientifiques",
    "editionYear": "2019",
    "isbn": "978-9931-825-02-9",
    "cote": "537-18",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Problem collection covering fundamental electrostatics concepts in vacuum, with complete solutions. Designed as a supplementary exercise book for electricity courses, providing practical training and exam preparation through worked examples."
  },
  {
    "title": "The chemical element: chemistry's contribution to our global future",
    "author": "Javier Garcia-Martinez, Elena Serrano-Torregrosa",
    "publisher": "Wiley-VCH",
    "editionYear": "2011",
    "isbn": "978-3-527-32880-2",
    "cote": "540-53",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "This collection highlights chemistry's role in addressing global challenges aligned with UN Millennium Development Goals. Experts examine critical areas including energy, climate, food, water and health, demonstrating how chemistry contributes to sustainable solutions. Published during the International Year of Chemistry, it serves both students and professionals interested in science's role in global development."
  },
  {
    "title": "Flash chemistry: fast organic synthesis in microsystems",
    "author": "Jun-ichi Yoshida",
    "publisher": "John Wiley & Sons",
    "editionYear": "2008",
    "isbn": "978-0-470-03586-3",
    "cote": "540-52",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Introduces the innovative concept of flash chemistry for ultra-fast, controlled organic synthesis using microsystems. Covers reaction dynamics, generation of reactive species, microsystem technology, and applications in organic/polymer synthesis and industry. Essential reading for researchers in organic synthesis, chemical engineering, and physical organic chemistry."
  },
  {
    "title": "Chemometrics: Statistics and Computer Application in Analytical Chemistry",
    "author": "Matthias Otto",
    "publisher": "Wiley-VCH",
    "editionYear": "2007",
    "isbn": "978-3-527-31418-8",
    "cote": "543-28",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Comprehensive guide to statistical analysis of chemical data, covering experimental design, pattern recognition, modeling, and modern computational methods. The 3rd edition includes new content on orthogonal signal correction, tree-based classification, independent component analysis, and neuro-fuzzy systems while retaining pedagogical features like worked examples and problems."
  },
  {
    "title": "Chemometrics: From Basics to Wavelet Transform",
    "author": "Chau Foo-Tim, Li-Lian Wang",
    "publisher": "Wiley",
    "editionYear": "2004",
    "isbn": "978-0-471-20242-4",
    "cote": "543-31",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "This book introduces wavelet transformations for chemometric data analysis, presenting chemical applications with minimal mathematics. It compares wavelet techniques with traditional methods and includes MATLAB examples. Designed for analytical chemists and statisticians, it bridges theory and practice with accessible explanations and practical examples."
  },
  {
    "title": "Chimie 3: introduction à la chimie inorganique, organique et à la chimie-physique",
    "author": "Andrew Burrows",
    "publisher": "De Boeck",
    "editionYear": "2012",
    "isbn": "978-2-8041-6486-7",
    "cote": "540-26",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Comprehensive textbook covering inorganic, organic and physical chemistry with balanced treatment of all three branches. Features detailed reaction mechanisms, practical examples, and connections between concepts. Includes online resources for molecular visualization and practice. Translated from the English edition 'Chemistry 3'."
  },
  {
    "title": "Chimie analytique",
    "author": "Douglas Arvid Skoog, Donald M. West, F. James Holler",
    "publisher": "De Boeck",
    "editionYear": "2012",
    "isbn": "978-2-8041-6295-5",
    "cote": "543-17",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "French translation of 'Fundamentals of Analytical Chemistry' (8th edition). Combines theoretical principles with laboratory practice, featuring modern computational tools for data analysis. Includes numerous illustrations, application examples, problems, and internet research activities. Essential resource for science students."
  },
  {
    "title": "Chimie générale",
    "author": "Raymond Chang, Luc Papillon",
    "publisher": "Chenelière McGraw-Hill",
    "editionYear": "2009",
    "isbn": "978-2-7651-0488-9",
    "cote": "540-24",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "General chemistry textbook (3rd edition) translated from English. Covers fundamental chemistry concepts with color illustrations. Includes answers to problems (pages 459-472). Suitable for introductory university chemistry courses."
  },
  {
    "title": "Chimie physique",
    "author": "Peter William Atkins, Julio de Paula",
    "publisher": "De Boeck",
    "editionYear": "2013",
    "isbn": "978-2-8041-6651-9",
    "cote": "541-04",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Comprehensive physical chemistry reference (4th edition, translated from 9th English edition). Features new 'Mathematical Foundations' sections, updated thermodynamics content, and a new catalysis chapter. Includes exercises with solutions and follows IUPAC terminology standards. Covers applications in biochemistry and environmental sciences."
  },
  {
    "title": "Frontiers of Climate Modeling",
    "author": "J.T. Kiehl, V. Ramanathan",
    "publisher": "Campus Press",
    "editionYear": "2011",
    "isbn": "978-0-521-29868-1",
    "cote": "551-84",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Physics",
    "description": "This reference work examines advanced climate modeling techniques, focusing on atmospheric physics and dynamics, atmosphere-ocean interactions, and the impacts of greenhouse gases and aerosols. Covers radiative forcing, cloud formation, deep convection dynamics, and coupled ocean-atmosphere models. Originally published in 2006, this edition captures significant developments in climate system modeling for researchers and graduate students."
  },
  {
    "title": "Grandeurs, unités et symboles de la chimie physique",
    "author": "International Union of Pure and Applied Chemistry (IUPAC)",
    "publisher": "De Boeck",
    "editionYear": "2012",
    "isbn": "978-2-8041-7207-7",
    "cote": "541-03",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Official French translation of the IUPAC 'Green Book' (3rd edition), providing standardized quantities, units and symbols for all branches of physical chemistry. Covers quantum chemistry, spectroscopy, thermodynamics, electrochemistry, surface chemistry and more. Serves as the definitive international reference for physical chemistry terminology and notation."
  },
  {
    "title": "Structure de la matière: cours et exercices corrigés",
    "author": "Ramdane Benazzouz",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-2-340-01783-2",
    "cote": "541-15",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Introductory textbook on matter structure for first-year science students, covering both physics and chemistry perspectives. Features progressive explanations, solved exercises, and updated content following IUPAC and IUPAP standards. Designed to help students overcome common difficulties in understanding atomic structure and material properties."
  },
  {
    "title": "Theory of stochastic differential equations with jumps and applications: mathematical and analytical techniques with applications to engineering",
    "author": "Rong Situ",
    "publisher": "Springer",
    "editionYear": "2005",
    "isbn": "978-0-387-25083-0",
    "cote": "515-212",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Comprehensive reference on stochastic differential equations (SDEs) covering Itô calculus, Girsanov's theorem, and applications in finance including option pricing. Introduces backward SDE techniques for financial markets and reflecting SDEs for population control. Valuable for graduate students and researchers in mathematics, physics, and engineering."
  },
  {
    "title": "Acido-basic catalysis: application to refining and petrochemistry",
    "author": "Christian Marcilly",
    "publisher": "Éditions Technip",
    "editionYear": "2006",
    "isbn": "978-2-7108-0861-9",
    "cote": "660-11",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Complete reference on acid-base catalysis in petroleum refining and petrochemistry. Covers reaction mechanisms, catalytic properties, and industrial applications. Focuses on hydrocarbon conversions and process selection criteria. Intended for professionals and students specializing in catalysis and hydrocarbon processing."
  },
  {
    "title": "Acido-basic catalysis: application to refining and petrochemistry",
    "author": "Christian Marcilly",
    "publisher": "Éditions Technip",
    "editionYear": "2006",
    "isbn": null,
    "cote": "660-12",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Second volume of the comprehensive reference on acid-base catalysis in petroleum refining and petrochemistry. Continues coverage of reaction mechanisms and industrial applications, with emphasis on practical process implementation and catalytic performance. Includes glossary and extensive references."
  },
  {
    "title": "Les 100 exercices-types de mathématiques MPSI-PCSI-PTSI: pour maîtriser toutes les méthodes, 50% méthodes + 50% exercices",
    "author": "Julien Freslon, Jérôme Poineau",
    "publisher": "EdiScience",
    "editionYear": "2007",
    "isbn": "978-2-10-051293-5",
    "cote": "510-43",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Collection of 100 essential math exercises for first-year French preparatory classes (MPSI-PCSI-PTSI). Each exercise is thoroughly analyzed with step-by-step solution methods, common mistakes to avoid, and useful tips. Covers all areas of the curriculum with a balanced approach between methodology and practice."
  },
  {
    "title": "1001 codes Python pour la modélisation: spécial prépas",
    "author": "Lionel Uhl",
    "publisher": "Ellipses",
    "editionYear": "2014",
    "isbn": "978-2-340-00002-5",
    "cote": "515-196",
    "numberOfCopies": 7,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Contains 60 Python modeling projects ranging from Sudoku to metaheuristics, including matrix diagonalization and partial differential equations. Designed for preparatory class students but also useful for engineering schools and universities. Features detailed algorithm explanations and implementation comments."
  },
  {
    "title": "15 leçons logique de mathématiques",
    "author": "Karl Djanseitov",
    "publisher": "OPU",
    "editionYear": "1986",
    "isbn": null,
    "cote": "510-15",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Introductory textbook covering 15 lessons in mathematical logic. Published by OPU (Office des Publications Universitaires) with a focus on fundamental logical concepts and reasoning in mathematics."
  },
  {
    "title": "30 problèmes de physique",
    "author": "François Graner",
    "publisher": "Dunod",
    "editionYear": "2008",
    "isbn": "978-2-10-052086-2",
    "cote": "530-32",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Collection of 30 physics problems inspired by everyday situations (yo-yo strings, sliding napkins, car trailers). Combines qualitative Anglo-Saxon approaches with French formal rigor. Designed for Master's students and teaching certification candidates (CAPES, agrégation)."
  },
  {
    "title": "350 Exercices de géométrie: classe de seconde exercices avec solutions",
    "author": "J.L. Boursin",
    "publisher": "Vuibert",
    "editionYear": "1979",
    "isbn": "978-2-7117-1330-1",
    "cote": "516-28",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Collection of 350 geometry exercises with solutions covering the French high school sophomore (seconde) curriculum. Focuses on fundamental learning exercises rather than tests, designed to help students acquire essential geometric knowledge and skills."
  },
  {
    "title": "40 expériences illustrées de chimie générale et organique: la chimie, une science expérimentale",
    "author": "Elodie Martinand-Lurin, Raymond Grüber",
    "publisher": "De Boeck",
    "editionYear": "2012",
    "isbn": "978-2-8041-7154-4",
    "cote": "540-18",
    "numberOfCopies": 7,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Collection of 40 illustrated experiments in general and organic chemistry, covering synthesis, physico-chemical characterization, analytical chemistry, and electrochemistry. Each experiment includes complete protocols, results interpretation, technical sheets, and cultural/historical context. Suitable for BTS, IUT, Bachelor's, Master's, and teaching certification preparation."
  },
  {
    "title": "450 exercices d'algèbre et de géométrie",
    "author": "J.L. Boursin",
    "publisher": "Vuibert",
    "editionYear": "1980",
    "isbn": "978-2-7117-1331-8",
    "cote": "510-103",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Collection of 450 algebra and geometry exercises with solutions for French high school first-year students. Features progressive exercises with short chapter summaries, designed as learning tools rather than tests. Emphasizes fundamental skill acquisition through systematic practice."
  },
  {
    "title": "Les 50 notions élémentaires de la chimie: 3 minutes pour comprendre",
    "author": "Nivaldo J. Tro",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-2-7029-1339-0",
    "cote": "540-51",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Introductory guide to 50 fundamental chemistry concepts including atoms, molecules, chemical reactions, organic chemistry, and thermodynamics. Uses illustrations and simple explanations to explore matter's properties and behavior. Translated from English, with coverage of polymers, nuclear fission, and biotechnologies."
  },
  {
    "title": "550 exercices d'algèbre",
    "author": "J.L. Boursin",
    "publisher": "Vuibert",
    "editionYear": "1981",
    "isbn": null,
    "cote": "512-126",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Collection of 550 algebra exercises with solutions for French high school first-year students. Organized by topic with progressive difficulty, featuring brief chapter summaries and elementary-level starter problems. Designed as a learning tool for daily practice."
  },
  {
    "title": "Abrupt climate change: mechanisms, patterns, and impacts",
    "author": "Harunur Rashid, Leonid Polyak, Ellen Mosley-Thompson",
    "publisher": "American Geophysical Union",
    "editionYear": "2011",
    "isbn": "978-0-87590-484-9",
    "cote": "551-47",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Examines abrupt climate changes through paleoclimate records (ice cores, marine sediments) and climate models. Covers meridional overturning circulation, climate feedbacks, and global temperature anomalies. For researchers studying millennial-scale climate events and their global impacts."
  },
  {
    "title": "L'adaptation au changement climatique",
    "author": "Valentine van Gameren, Romain Weikmans, Edwin Zaccaï",
    "publisher": "La Découverte",
    "editionYear": "2014",
    "isbn": "978-2-7071-7469-7",
    "cote": "551-29",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Explores climate change adaptation policies across international, national and local levels. Examines societal vulnerability, private sector roles (businesses, insurers), and implementation challenges. Provides historical context and key references on this emerging field of climate studies."
  },
  {
    "title": "L'adaptation au changement climatique : une question de sociétés",
    "author": "Agathe Euzen, Bettina Laville, Stéphanie Thiébault",
    "publisher": "CNRS / Comité 21",
    "editionYear": "2011",
    "isbn": "978-2-271-09482-7",
    "cote": "551-67",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "S'adapter au changement climatique comme au changement global est devenu un objectif vital pour toutes les sociétés. Cet ouvrage, composé d'une cinquantaine d'articles écrits par des scientifiques et experts, explore l'adaptation et la maladaptation sous divers angles disciplinaires et territoriaux. Il propose des solutions pour faire face aux impacts climatiques."
  },
  {
    "title": "Adaptation aux changements climatiques en zones côtières : politiques publiques et indicateurs de suivi des progrès dans sept pays occidentaux",
    "author": "Moktar Lamari, Johann Lucas Jacob",
    "publisher": "Presses de l'Université du Québec",
    "editionYear": "2016",
    "isbn": "978-2-7605-4366-9",
    "cote": "551-64",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Analyse des efforts en matière d'indicateurs d'adaptation aux changements climatiques (ACC) en zones côtières dans sept pays de l'OCDE. L'étude évalue les mécanismes de prise de décision et les stratégies d'adaptation face à l'élévation du niveau de la mer et aux événements météorologiques extrêmes."
  },
  {
    "title": "L'adaptation de la France au changement climatique",
    "author": "Ouvrage collectif (ONERC)",
    "publisher": "DOC FRANCAISE",
    "editionYear": "2012",
    "isbn": "978-2-11-008825-3",
    "cote": "551-96",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Présente le plan national d'adaptation au changement climatique en France, élaboré après une large concertation. Contient 84 actions pour prévenir les risques climatiques et assurer la cohérence des politiques publiques. Inclut une rétrospective sur 10 ans de lutte contre le changement climatique."
  },
  {
    "title": "Advances in model-based predictive control",
    "author": "D. Clarke",
    "publisher": "Oxford University Press",
    "editionYear": "1994",
    "isbn": "978-0-19-856292-4",
    "cote": "517-51",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Explores algorithm developments, industrial applications, and comparisons with other approaches in model-based predictive control (MBPC). Focuses on systems with response delays, such as chemical plants, where traditional feedback control is insufficient."
  },
  {
    "title": "Aéronomie : physique et chimie de l'atmosphère",
    "author": "Gaston Kockarts",
    "publisher": "De Boeck université",
    "editionYear": "2000",
    "isbn": "978-2-8041-3456-3",
    "cote": "530-14",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Ouvrage sur la physique et la chimie de l'atmosphère, couvrant les principes fondamentaux de l'aéronomie. Comprend des illustrations et une bibliographie détaillée."
  },
  {
    "title": "Aérosols Atmosphériques : Propriétés et Impacts Climatiques",
    "author": "Olivier Boucher",
    "publisher": "Springer",
    "editionYear": "2012",
    "isbn": "978-2-8178-0054-7",
    "cote": "551-117",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Physics",
    "description": "Explore le rôle des aérosols dans le climat, leur interaction avec le rayonnement et le cycle de l'eau. Couvre la modélisation, la télédétection et les perspectives d'ingénierie climatique. Destiné aux étudiants et chercheurs en sciences du climat."
  },
  {
    "title": "Agrégation de mathématiques : questions délicates en algèbre et géométrie",
    "author": "Annette Paugam",
    "publisher": "Dunod",
    "editionYear": "2007",
    "isbn": "978-2-10-051378-9",
    "cote": "510-14",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Guide pour les candidats à l'agrégation de mathématiques, avec des exemples illustratifs, des exercices et des réponses aux questions fréquentes du jury. Couvre l'algèbre et la géométrie avec une approche pédagogique."
  },
  {
    "title": "Aide-mémoire de chimie organique industrielle",
    "author": "Bernard Martel",
    "publisher": "Dunod",
    "editionYear": "1996",
    "isbn": "978-2-10-003001-9",
    "cote": "547-11",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Synthèse des procédés industriels en chimie organique, présentés sous forme de schémas (flowcharts). Inclut les usages des composés et un index détaillé. Utile pour les étudiants et professionnels."
  },
  {
    "title": "Aide mémoire de l'ingénieur",
    "author": "Walter G.",
    "publisher": "OPU (Alger)",
    "editionYear": "1980",
    "isbn": null,
    "cote": "620-26",
    "numberOfCopies": 8,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Manuel de référence pour les ingénieurs, couvrant divers domaines techniques. Aucun résumé détaillé fourni dans les données d'origine."
  },
  {
    "title": "Aide mémoire de mathématiques pour ingénieurs : 2 eme partie",
    "author": "Ouragh Youcef",
    "publisher": "OPU (Alger)",
    "editionYear": "1993",
    "isbn": null,
    "cote": "510-115",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Deuxième partie d'un ouvrage de référence en mathématiques destiné aux ingénieurs, couvrant les concepts essentiels sous forme d'aide-mémoire."
  },
  {
    "title": "Aide-mémoire de mathématiques supérieures",
    "author": "Marc Vygodski",
    "publisher": "Éditions Mir (Moscou)",
    "editionYear": "1973",
    "isbn": null,
    "cote": "510-105",
    "numberOfCopies": 17,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage complet de référence en mathématiques supérieures, présentant les concepts fondamentaux sous forme condensée."
  },
  {
    "title": "Aide-mémoire de mathématiques, à l'usage des ingénieurs et des élèves des grandes écoles",
    "author": "Konstantin Adolʹfovič Semendâev, Ilʹâ Nikolaevič Bronštejn",
    "publisher": "Eyrolles (Paris)",
    "editionYear": "1979",
    "isbn": null,
    "cote": "510-62",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage de référence complet en mathématiques destiné aux ingénieurs et élèves des grandes écoles, incluant des tableaux et figures explicatives."
  },
  {
    "title": "Alerte rouge : agir contre le réchauffement climatique",
    "author": "Tim Flannery",
    "publisher": "Héloïse d'Ormesson (Paris)",
    "editionYear": "2006",
    "isbn": "978-2-35087-099-1",
    "cote": "551-125",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Ouvrage engagé sur le réchauffement climatique, mêlant vulgarisation scientifique et essai géopolitique. Présente les impacts environnementaux de l'activité humaine et appelle à l'action pour les générations futures."
  },
  {
    "title": "Algebraic topology: an introduction",
    "author": "William S. Massey",
    "publisher": "Springer (New York)",
    "editionYear": "1989",
    "isbn": "0-387-90271-6",
    "cote": "514-04",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Introduction classique à la topologie algébrique, couvrant les groupes fondamentaux, les espaces de revêtement et d'autres concepts clés. Issu de cours donnés à Yale University."
  },
  {
    "title": "Algèbre",
    "author": "Mohamed Zitouni",
    "publisher": "OPU (Alger)",
    "editionYear": "1990",
    "isbn": null,
    "cote": "512-90",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel d'algèbre fondamentale publié par l'Office des Publications Universitaires algérien."
  },
  {
    "title": "Algèbre et Analyse",
    "author": "Khelifa Zizi",
    "publisher": null,
    "editionYear": null,
    "isbn": null,
    "cote": "515-94",
    "numberOfCopies": 9,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage combinant algèbre et analyse mathématique."
  },
  {
    "title": "Algèbre et analyse: classe terminales C,D et E",
    "author": "Lebossé C., Hémery C.",
    "publisher": "Fernand Nathan (Paris)",
    "editionYear": "1966",
    "isbn": null,
    "cote": "512-117",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel scolaire historique couvrant l'algèbre et l'analyse pour les classes terminales scientifiques."
  },
  {
    "title": "Algèbre et analyse: cours de mathématiques de première année avec exercices corrigés",
    "author": "Stéphane Balac, Frédéric Sturm",
    "publisher": "Presses polytechniques et universitaires romandes (Lausanne)",
    "editionYear": "2009",
    "isbn": "978-2-88074-828-9",
    "cote": "512-55",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Cours complet de mathématiques de première année pour écoles d'ingénieurs, avec exercices corrigés. Couvre algèbre linéaire, calcul différentiel et intégral, et utilise le logiciel MAPLE pour illustrations."
  },
  {
    "title": "Algorithmes et fonctions recursives",
    "author": "I. Maltsev",
    "publisher": "OPU (Alger)",
    "editionYear": "1980",
    "isbn": null,
    "cote": "515-137",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur les algorithmes et les fonctions récursives, publié par l'Office des Publications Universitaires algérien."
  },
  {
    "title": "Algorithmique & mathématiques: travaux pratiques et applications Scilab pour le lycée et la licence",
    "author": "José Ouin",
    "publisher": "Ellipses (Paris)",
    "editionYear": "2010",
    "isbn": "978-2-7298-5439-3",
    "cote": "517-52",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Travaux pratiques d'algorithmique appliquée aux mathématiques avec solutions en Scilab. Couvre les fonctions, probabilités, suites, arithmétique et géométrie. Adapté aux lycéens et étudiants de licence."
  },
  {
    "title": "Alternative energy and shale gas encyclopedia",
    "author": "Jay H. Lehr, J. W. Keeley, Thomas B. Kingery",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-0-470-89441-5",
    "cote": "551-55",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Encyclopédie complète sur le gaz de schiste et les énergies alternatives, organisée par type d'énergie. Met l'accent sur les applications pratiques des technologies existantes."
  },
  {
    "title": "An engineer's guide to MATLAB: with applications from mechanical, aerospace, electrical, and civil engineering",
    "author": "Edward B. Magrab",
    "publisher": "Pearson Prentice Hall (Upper Saddle River, NJ)",
    "editionYear": "2005",
    "isbn": "0-13-145499-4",
    "cote": "510-96",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide pour utiliser MATLAB afin de résoudre des problèmes d'ingénierie. Couvre les matrices, graphiques, systèmes de contrôle, mécanique des fluides, transfert de chaleur et statistiques techniques."
  },
  {
    "title": "Analyse: 117 exercices corrigés, 111 tests & rappels de cours",
    "author": "Bernadette Gérardin, Philippe Heudron",
    "publisher": "Dunod (Paris)",
    "editionYear": "1990",
    "isbn": "978-2-04-020707-6",
    "cote": "515-111",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage d'analyse mathématique avec exercices corrigés, tests et rappels de cours, destiné aux classes préparatoires HEC et premiers cycles universitaires scientifiques et économiques."
  },
  {
    "title": "Analyse (3): Les Mathématiques au 1er cycle (ex PC 2e année) et dans les classes préparatoires",
    "author": "P. Louquet, A. Vogt",
    "publisher": null,
    "editionYear": null,
    "isbn": null,
    "cote": "515-103",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel d'analyse mathématique pour le premier cycle universitaire et les classes préparatoires."
  },
  {
    "title": "Analyse algorithme et programme en pascal",
    "author": "Jean Louis Jardrin",
    "publisher": "Dunod (Paris)",
    "editionYear": "1989",
    "isbn": "978-2-04-018802-3",
    "cote": "005-747",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Ouvrage sur l'analyse algorithmique et la programmation en Pascal."
  },
  {
    "title": "Analyse : apprendre à partir d'une base d'exercices ; niveau L1",
    "author": null,
    "publisher": "Dunod (Paris)",
    "editionYear": "2013",
    "isbn": "978-2-10-057665-4",
    "cote": "515-190",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel d'analyse pour la première année de Licence, couvrant les démonstrations, nombres complexes, suites et fonctions. Propose des problèmes variés avec solutions et points méthodologiques."
  },
  {
    "title": "Analyse chimique : Méthodes et techniques instrumentales",
    "author": "Francis Rouessac, Annick Rouessac, Daniel Cruché",
    "publisher": "Dunod (Paris)",
    "editionYear": "1992",
    "isbn": "978-2-10-079607-6",
    "cote": "540-77",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Panorama des méthodes d'analyse chimique instrumentale pour divers secteurs industriels et laboratoires. Comprend des exercices corrigés et des compléments sur les statistiques et normes."
  },
  {
    "title": "Analyse complexe : un regard analytique et géométrique enrichi de 230 exercices corrigés",
    "author": "Alain Yger",
    "publisher": "Ellipses (Paris)",
    "editionYear": "2014",
    "isbn": "978-2-340-00029-2",
    "cote": "515-198",
    "numberOfCopies": 9,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage d'analyse complexe en une variable pour le niveau master, combinant approches géométrique et analytique. Comprend 230 exercices corrigés et aborde des fonctions classiques comme celles d'Euler et Riemann."
  },
  {
    "title": "Analyse : concepts et contextes",
    "author": "James Stewart",
    "publisher": "De Boeck université (Paris)",
    "editionYear": "2001",
    "isbn": "978-2-7445-0118-0",
    "cote": "515-97",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Manuel en 2 volumes présentant l'analyse mathématique avec une approche conceptuelle. Volume 1: fonctions d'une variable, Volume 2: fonctions de plusieurs variables. Inclut des formulaires."
  },
  {
    "title": "Analyse: Concepts et contextes. Volume 1 Fonctions d'une variable",
    "author": "Micheline Citta-Vanthemsche",
    "publisher": "De Boeck ([Paris])",
    "editionYear": "2011",
    "isbn": "978280416306",
    "cote": "515-243",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Volume 1 sur les fonctions d'une variable, mettant l'accent sur la compréhension des concepts. Approche pédagogique avec utilisation des calculatrices graphiques et logiciels de calcul. 3e édition enrichie."
  },
  {
    "title": "Analyse : cours et exercices corrigés",
    "author": "François Cottet-Emard",
    "publisher": "De Boeck (Bruxelles)",
    "editionYear": "2005",
    "isbn": "978-2-8041-4907-9",
    "cote": "515-98",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Cours d'analyse mathématique avec exercices corrigés, faisant partie de la collection LMD Sciences Mathématiques."
  },
  {
    "title": "Analyse du cycle de vie: Comprendre et réaliser un écobilan",
    "author": "Olivier Jolliet, Myriam Saadé, Pierre Crettaz",
    "publisher": "Presses polytechniques et universitaires romandes (Lausanne)",
    "editionYear": "2010",
    "isbn": "978-2-88074-886-9",
    "cote": "551-154",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Guide complet sur l'analyse du cycle de vie (ACV) pour évaluer l'impact environnemental des produits. Présente la démarche méthodologique avec études de cas et exercices. 2e édition mise à jour."
  },
  {
    "title": "Analyse des données multidimensionnelles : statistique en sciences humaines",
    "author": "Henry Rouanet, Brigitte Le Roux",
    "publisher": "Dunod (Paris)",
    "editionYear": "1993",
    "isbn": "978-2-10-000063-0",
    "cote": "519-70",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Méthodes statistiques pour l'analyse des données multidimensionnelles, appliquées aux sciences humaines."
  },
  {
    "title": "Applied statistics using the computer",
    "author": "Ronald S. King, Bryant Julstrom",
    "publisher": "Alfred Pub. Co. (Sherman Oaks, CA)",
    "editionYear": "1982",
    "isbn": "978-0-88284-174-8",
    "cote": "519-69",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Textbook on applied statistics with computer applications. Covers statistical methods and their implementation using computers."
  },
  {
    "title": "Applied studies in climate adaptation",
    "author": "J.P. Palutikof, Sarah Boulter, Jon Barnett, David Rissik",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-1-118-84501-1",
    "cote": "551-52",
    "numberOfCopies": 3,
    "coverUrl": null,
    "department": "Physics",
    "description": "Case studies on climate change adaptation practices across various sectors including agriculture, coastal zones, and indigenous populations. Features contributions from international experts in adaptation research."
  },
  {
    "title": "Les Apprentis sorciers du climat: Raisons et déraisons de la géo-ingénierie",
    "author": "Clive Hamilton",
    "publisher": "Éditions du Seuil (Paris)",
    "editionYear": "2013",
    "isbn": "978-2-02-112026-4",
    "cote": "551-91",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Critical examination of geoengineering proposals to address climate change, including atmospheric sulfur injection and ocean chemistry modification. Questions the ethics and risks of large-scale climate manipulation."
  },
  {
    "title": "Approche fonctionnelle des calculs scientifiques: méthodes numériques et applications; langage Python",
    "author": "Gérald Jean-Baptiste",
    "publisher": "Cépaduès-éditions (Toulouse)",
    "editionYear": "2016",
    "isbn": "978-2-36493-556-3",
    "cote": "515-209",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Computer Science",
    "description": "Guide to functional programming in Python for scientific computing. Covers numerical methods, recursive functions, and list processing with practical applications for engineering and research."
  },
  {
    "title": "Approche statistique pour les écoulements turbulents pariétaux",
    "author": "Sedat Tardu",
    "publisher": "Hermès science publications-Lavoisier (Paris)",
    "editionYear": "2010",
    "isbn": "978-2-7462-3132-0",
    "cote": "519-12",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Statistical analysis of wall-bounded turbulent flows. Covers fundamental turbulence concepts, spectral behavior, Reynolds number effects, and vorticity transport for graduate students and researchers."
  },
  {
    "title": "Arithmétique. Classe de mathématiques. Programme 1962",
    "author": "Roger Pernet, Victor Lespinard",
    "publisher": "A. Desvigne (Lyon)",
    "editionYear": "1963",
    "isbn": null,
    "cote": "510-30",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Arithmetic textbook following the 1962 mathematics curriculum for secondary education in France."
  },
  {
    "title": "Arithmétique et cryptologie",
    "author": "Gilles Bailly-Maître",
    "publisher": "Ellipses (Paris)",
    "editionYear": "2012",
    "isbn": "978-2-7298-7488-9",
    "cote": "512-76",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Ouvrage sur les fondements mathématiques des algorithmes cryptographiques (RSA, DES, AES). Explique les concepts d'arithmétique modulaire et les structures algébriques sous-jacentes aux systèmes de cryptage modernes. Comprend des exercices corrigés."
  },
  {
    "title": "Aspects des systèmes dynamiques",
    "author": "Nicole Berline, Claude Sabbah",
    "publisher": "Éd. de l'École polytechnique (Palaiseau)",
    "editionYear": "2009",
    "isbn": "978-2-7302-1560-2",
    "cote": "515-240",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Recueil de textes sur la théorie des systèmes dynamiques, couvrant les applications itératives, les orbites périodiques et la dynamique polynomiale. Comprend des introductions élémentaires et des questions non résolues."
  },
  {
    "title": "Astrophysique : étoiles, univers et relativité",
    "author": "Jean Heyvaerts",
    "publisher": null,
    "editionYear": null,
    "isbn": "978-2-10-082759-6",
    "cote": "530-161",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Manuel d'astrophysique couvrant les étoiles, la cosmologie et la relativité. 2e édition avec exercices corrigés."
  },
  {
    "title": "Atmosphère, océan et climat",
    "author": "Robert Delmas, Serge Chauzy",
    "publisher": "Belin (Paris)",
    "editionYear": "2007",
    "isbn": "978-2-7011-4508-2",
    "cote": "551-82",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Physics",
    "description": "Ouvrage illustré sur les interactions atmosphère-océan et les phénomènes climatiques. Aborde les nuages, courants marins, effet de serre et événements extrêmes."
  },
  {
    "title": "De l'atome imaginé à l'atome découvert : contre le relativisme",
    "author": "Hubert Krivine, Annie Grosman",
    "publisher": "De Boeck (Louvain-la-Neuve)",
    "editionYear": "2015",
    "isbn": "978-2-8041-9072-9",
    "cote": "541-12",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Histoire épistémologique de la conception atomique, des philosophes grecs aux preuves expérimentales modernes. Critique du relativisme scientifique."
  },
  {
    "title": "De l'atome au nucléaire : un siècle de prouesses scientifiques et d'enjeux politiques",
    "author": "Michel Chauvin",
    "publisher": "Presses internationales Polytechnique (Montréal)",
    "editionYear": "2009",
    "isbn": "978-2-553-01421-5",
    "cote": "530-74",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Physics",
    "description": "Histoire complète de l'énergie nucléaire, des découvertes fondamentales aux applications civiles et militaires. Analyse les défis techniques et éthiques."
  },
  {
    "title": "Les atomes",
    "author": "Jean Perrin",
    "publisher": "CNRS éditions (Paris)",
    "editionYear": "2014",
    "isbn": "978-2-271-08260-2",
    "cote": "541-10",
    "numberOfCopies": 1,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Réédition du texte classique de 1913 qui apporta la preuve définitive de l'existence des atomes. Couvre le mouvement brownien, la structure moléculaire et la théorie des quanta."
  },
  {
    "title": "Atomes : une exploration visuelle de tous les éléments connus dans l'univers",
    "author": "Theodore W. Gray",
    "publisher": "Place des victoires (Paris)",
    "editionYear": "2013",
    "isbn": "978-2-8099-1060-5",
    "cote": "541-13",
    "numberOfCopies": 5,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Guide illustré du tableau périodique, présentant chaque élément avec ses propriétés et applications. Édition revue et augmentée."
  },
  {
    "title": "Atomes et liaisons chimiques A l'usage des troncs communs",
    "author": "Zohir Sekkal",
    "publisher": null,
    "editionYear": null,
    "isbn": null,
    "cote": "540-05",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Chemistry",
    "description": "Manuel sur la structure atomique et les types de liaisons chimiques, destiné aux étudiants de tronc commun."
  },
  {
    "title": "Autour du nombre Pi",
    "author": "Pierre Eymard, Jean-Pierre Lafon",
    "publisher": "Hermann (Paris)",
    "editionYear": "1999",
    "isbn": "978-2-7056-1443-0",
    "cote": "519-115",
    "numberOfCopies": 2,
    "coverUrl": null,
    "department": "Mathematics",
    "description": "Étude mathématique approfondie du nombre π, suivant son histoire et ses applications dans diverses branches des mathématiques. Comprend 100 exercices avec solutions."
  }


]